{
  "competition_id": "2022_AMC_12A_Problems",
  "problem_id": 9,
  "difficulty": 2,
  "problem": "On Halloween $31$ children walked into the principal's office asking for candy. They\ncan be classified into three types: Some always lie; some always tell the truth; and\nsome alternately lie and tell the truth. The alternaters arbitrarily choose their first\nresponse, either a lie or the truth, but each subsequent statement has the opposite\ntruth value from its predecessor. The principal asked everyone the same three\nquestions in this order.\n\"Are you a truth-teller?\" The principal gave a piece of candy to each of the $22$\nchildren who answered yes.\n\"Are you an alternater?\" The principal gave a piece of candy to each of the $15$\nchildren who answered yes.\n\"Are you a liar?\" The principal gave a piece of candy to each of the $9$ children who\nanswered yes.\nHow many pieces of candy in all did the principal give to the children who always\ntell the truth?\n$\\textbf{(A) } 7 \\qquad \\textbf{(B) } 12 \\qquad \\textbf{(C) } 21 \\qquad \\textbf{(D) } 27 \\qquad \\textbf{(E) } 31$",
  "solutions": {
    "Solution 1": "Note that:\nTruth-tellers would answer yes-no-no to the three questions in this order. \nLiars would answer yes-yes-no to the three questions in this order. \nAlternaters who responded truth-lie-truth would answer no-no-no to the three questions in this order. \nAlternaters who responded lie-truth-lie would answer yes-yes-yes to the three questions in this order. \nSuppose that there are $T$ truth-tellers, $L$ liars, and $A$ alternaters who responded lie-truth-lie.\nThe conditions of the first two questions imply that\n\\begin{align*} T+L+A&=22, \\\\ L+A&=15. \\end{align*}\nSubtracting the second equation from the first, we have $T=22-15=\\boxed{\\textbf{(A) } 7}.$\n\nThe condition of the third question is extraneous. However, we know that there are $9$ alternaters who responded lie-truth-lie, $6$ liars, and $9$ alternaters who responded truth-lie-truth from this condition.",
    "Solution 2": "Consider when the principal asks \"Are you a liar?\": The truth tellers truthfully say no, and the liars lie and say no. This leaves only alternaters who lie on this question to answer yes. Thus, all $9$ children that answered yes are alternaters that falsely answer Questions 1 and 3, and truthfully answer Question 2. The rest of the alternaters, however many there are, have the opposite behavior.\nConsider the second question, \"Are you an alternater?\": The truth tellers again answer no, the liars falsely answer yes, and alternaters that truthfully answer also say yes. From the previous part, we know that $9$ alternaters truthfully answer here. Because only liars and $9$ alternaters answer yes, we can deduce that there are $15-9=6$ liars.\nConsider the first question, \"Are you a truth teller?\": Truth tellers say yes, liars also say yes, and alternaters that lie on this question also say yes. From the first part, we know that $9$ alternaters lie here. From the previous part, we know that there are $6$ liars. Because only the number of truth tellers is unknown here, we can deduce that there are $22-9-6=7$ truth tellers.\nThe final question is how many pieces of candy did the principal give to truth tellers. Because truth tellers answer yes on only the first question, we know that all $7$ of them said yes once, resulting in $\\boxed{\\textbf{(A) } 7}$ pieces of candy.",
    "Solution 3": "Note that we have $4$ types of people: \n$T,$ The truth tellers, who will answer yes-no-no to the questions. \n$L,$ The liars, who will answer yes-yes-no to the questions. \n$A,$ The alternators who START truthfully, who will answer yes-yes-yes to the questions. \nThe alternators who START by lying, who will answer no-no-no to the questions.\nGiven this information, it is reasonable to ignore the fourth type, because they will never answer yes to any question. Hence, we only consider people of type $1, 2,$ and $3.$\nThe principal's first question implies that \n\\[T + L + A = 22.\\]\nThe second question implies that\n\\[L + A = 15.\\]\nThe third question implies that \n\\[A = 9.\\]\nSolving, we find that $T = 7,$ so $\\boxed{\\textbf{(A) } 7}$ is our answer. We can also note that $T = 7,  L = 6,  A = 9,$ and there are $9$ alternators who answer no to every question."
  }
}