{
  "competition_id": "2020_AMC_12B_Problems",
  "problem_id": 14,
  "difficulty": 3,
  "problem": "Bela and Jenn play the following game on the closed interval $[0, n]$ of the real number line, where $n$ is a fixed integer greater than $4$. They take turns playing, with Bela going first. At his first turn, Bela chooses any real number in the interval $[0, n]$. Thereafter, the player whose turn it is chooses a real number that is more than one unit away from all numbers previously chosen by either player. A player unable to choose such a number loses. Using optimal strategy, which player will win the game?\n$\\textbf{(A)} \\text{ Bela will always win.} \\qquad \\textbf{(B)} \\text{ Jenn will always win.} \\qquad \\textbf{(C)} \\text{ Bela will win if and only if }n \\text{ is odd.} \\\\ \\textbf{(D)} \\text{ Jenn will win if and only if }n \\text{ is odd.} \\qquad \\textbf{(E)} \\text { Jenn will win if and only if } n>8.$",
  "solutions": {
    "Solution 1 (Symmetry)": "If Bela selects the middle number in the range $[0, n]$ and then mirror whatever number Jenn selects, then if Jenn can select a number within the range, so can Bela. Jenn will always be the first person to run out of a number to choose, so the answer is $\\boxed{\\textbf{(A)} \\text{ Bela will always win.}}$",
    "Solution 2 (Educated Guess)": "First of all, realize that the parity of $n$ likely has no effect on the strategy, since Bela obviously wins when $n=1$, and it's not hard to find a winning strategy for $n=2$ or $n=3$ (start with $n/2$).  Similarly, there is no reason the strategy would change when $n>8.$\nSo we are left with $\\textbf{(A)}$ and $\\textbf{(B)}.$ From here it is best to try out random numbers and try to find the strategy that will let Bela win, but if you can't find it, realize that it is more likely the answer is $\\boxed{\\textbf{(A)} \\text{ Bela will always win}}$ since Bela has the first move and thus has more control.",
    "Solution 3 (Simulation)": "We can just play the game. We can draw a number line to $9$ and assume Bela and Jenn will only play the integer values. From now after playing one round of the game, Bela will win so answers $\\textbf{(B)},\\textbf{(D)},$ and $\\textbf{(E)}$ are eliminated. Now we want to test if Bela will win if $n$ is even so we can draw another number line this time up to $10$. Now after playing the game, we can find that Bela won yet again so the answer is $\\boxed{\\textbf{(A)} \\text{ Bela will always win}}.$"
  }
}