{
  "competition_id": "2024_USAJMO_Problems",
  "problem_id": 4,
  "difficulty": 6,
  "problem": "Let $n \\ge 3$ be an integer. Rowan and Colin play a game on an $n \\times n$ grid of squares, where each square is colored either red or blue. Rowan is allowed to permute the rows of the grid, and Colin is allowed to permute the columns of the grid. A grid coloring is $orderly$ if:\n1. no matter how Rowan permutes the rows of the coloring, Colin can then permute the columns to restore the original grid coloring; and\n2. no matter how Colin permutes the column of the coloring, Rowan can then permute the rows to restore the original grid coloring;\nIn terms of $n$, how many orderly colorings are there?",
  "solutions": {
    "Solution 1": "We focus on the leftmost column for simplicity. Let $m$ be the number of red squares in this column. We then have five cases:\n\n1. $m=1$\nWhen Rowan permutes the rows of the coloring, we consider only the first column, which by the above contains $m=1$ red colors, so there are ${n \\choose 1}=n$ ways to permute the first column’s rows. Thus every other column will have to contain one different permutation of the first column; otherwise, there will be at least one permutation of which there is no corresponding column.\n\nFurthermore, each permutation will be different, so each row will contain one and only one red square, which also fulfills the case of if Colin permutes the coloring first. Thus there are $n\\cdot (n-1)\\cdot(n-2)\\cdot\\cdot\\cdot2\\cdot1=n!$ different colorings for this case (the same as choosing squares such as no square is in the same row or column as any other square).\n\n2. $m=n-1$\nThis is essentially the same as case 1 except for the coloring; now there is one blue square and the rest are red squares. Thus there are also $n!$ different colorings for this case.\n\n3. $m=0$\nSince we have an entirely blue column, we are unable to have a column with $1$ red square only as doing so would leave one permutation that is not covered by at least one column (that space is being taken for the blank column). We are also unable to have a completely blue column as doing so would allow for Colin to shift the columns and in doing so fail for Rowan to shift back the columns. We also cannot have a column with any other number of red squares other than $0$ as will be shown below, so there is $1$ case here in which the entire coloring is red.\n\n4. $m=n$\nThis is the same is an entire blue column, and, similar to above, we have $1$ coloring.\n\n5. $1<m<n-1$\nThis is the final case and is equivalent to permuting for ${n \\choose m}$ different ways. We must prove that this is greater than $n$ to show that the columns are not able to contain every possible permutation of this column for all values of $n$ such that $n>3$ (when $n=3$, there is no such positive integer $m$ that satisfies the conditions). Note that if we have any column with a different number of red squares, it is an unattainable column and is thus not optimal.\n\nLemma: Given that $m$ and $n$ are positive integers such that $1<m<n-1$ and $n>3$, it is true for all $m$ and $n$ that ${n \\choose m}>n$.\nProof: Assume that $m<\\frac{n-1}{2}$.\n$\\Leftrightarrow$ $m+1<n-m$\n$\\Leftrightarrow$ $(m+1)!(n-m-1)!<m!(n-m)!$\n$\\Leftrightarrow$ $\\frac{n!}{m!(n-m)!}<\\frac{n!}{(m+1)!(n-m-1)!}$\n$\\Leftrightarrow$ ${n \\choose m}<{n \\choose m+1}$\nSimilarly, we can prove that ${n \\choose m}>{n \\choose m+1}$ for $m>\\frac{n-1}{2}$.\nNow we split our proof into two cases.\nCase 1: $n$ is even.\nThe largest integer less than $\\frac{n-1}{2}$ is $\\frac{n}{2}-1$, so we know that:\n${n \\choose \\frac{n}{2}}>{n \\choose \\frac{n}{2}-1}>\\cdot\\cdot\\cdot>{n \\choose 2}$\nby induction. On the other hand, the smallest integer greater than $\\frac{n-1}{2}$ is $\\frac{n}{2}$, so we know that:\n${n \\choose \\frac{n}{2}}>{n \\choose \\frac{n}{2}+1}>\\cdot\\cdot\\cdot>{n \\choose n-2}$\nalso by induction. Thus out of the given range for $m$ we know that ${n \\choose 2}$ and ${n \\choose n-2}$ are the minimum values, and all that is left is to prove that they are both greater than $n$. Furthermore, since ${n \\choose 2}={n \\choose n-2}$, we only have to prove that ${n \\choose 2}>n$.\nWe start with the given: $n>3$\n$\\Leftrightarrow$ $\\frac{n-1}{2}>1$\n$\\Leftrightarrow$ $\\frac{n(n-1)}{2}>n$\n$\\Leftrightarrow$ $\\frac{n!}{2!(n-2)!}>n$\n$\\Leftrightarrow$ ${n \\choose 2}>n$\nThus we have proven the inequality for all even $n$.\nCase 2: $n$ is odd.\nThe greatest integer less than $\\frac{n-1}{2}$ is $\\frac{n-3}{2}$, so we know that:\n${n \\choose \\frac{n-1}{2}}>{n \\choose \\frac{n-3}{2}}>\\cdot\\cdot\\cdot>{n \\choose 2}$\nby induction. On the other hand, the smallest integer greater than $\\frac{n-1}{2}$ is $\\frac{n+1}{2}$, so we know that:\n${n \\choose \\frac{n+1}{2}}>{n \\choose \\frac{n+3}{2}}>\\cdot\\cdot\\cdot>{n \\choose n-2}$\nalso by induction. Since ${n \\choose \\frac{n+1}{2}}={n \\choose \\frac{n-1}{2}}$, we know that once again, ${n \\choose n-2}={n \\choose 2}$ is the minimum of the given range for $m$, and the same proof applies. Thus, the inequality holds true for odd and in turn all positive integers $n>3$.\n\nAs a result, due to our lemma, there are always more permutations of the columns than the number of columns itself, so there will always exist a permutation of the column such that there are no corresponding original columns of which to match with. Thus there are no solutions for this case.\n\nIn conclusion, there are a total of $2\\cdot n!+2$ different colorings for which the above apply.\n"
  }
}