{
  "competition_id": "2020_USAJMO_Problems",
  "problem_id": 2,
  "difficulty": 6.5,
  "problem": "Let $\\omega$ be the incircle of a fixed equilateral triangle $ABC$. Let $\\ell$ be a variable line that is tangent to $\\omega$ and meets the interior of segments $BC$ and $CA$ at points $P$ and $Q$, respectively. A point $R$ is chosen such that $PR = PA$ and $QR = QB$. Find all possible locations of the point $R$, over all choices of $\\ell$.",
  "solutions": {
    "Solution 1": "Call a point  if it is a possible location for $R$.\nLet the incircle of $\\triangle ABC$ touch $BC$ at $D$, $AC$ at $E$, and $\\ell$ at $T$. Also, let the center of the incircle be $I$. Clearly, a point is good iff it lies on the circle containing $A$ with center $P$ as well as the circle containing $B$ with center $Q$. Call these circles $\\omega_1$ and $\\omega_2$, respectively.\nNote that point $T$ can only lie on minor arc $\\overarc{DE}$ (excluding the endpoints). \n A point $X$ is good iff $XT\\perp PQ$ and $XT=AD=BE$.\n WLOG, let $X$ be on the same side of $PQ$ as $I$. Then we have that $T, I, X$ are collinear. In particular, we have $\\angle XTP=90^{\\circ}$. Then $TX=AD$, $PT=PD$, $\\angle XTP=\\angle ADP$, so that $\\triangle ADP\\cong \\triangle XTP\\rightarrow PA=PX$. Similarly, $QB=QX$, so $X$ is good. Then $X'$, the reflection of $X$ across $T$, is also good. But $\\omega_1$ and $\\omega_2$ have at most two intersections, so $X$ and $X'$ must be these intersections, and since a point is good iff it lies on both circles, we are done.\nNow, we know that $R, I, T$ are collinear. Then we have two cases:\n $R$ and $I$ lie on the same side of $PQ$. Then we have $RI+IT=AI+ID=BI+IE$, so that $RI=AI=BI$. Then we have that $R, A, B$ lie on a circle with center $I$. Note that because $T$ lies on $\\overarc{DE}$, $R$ must lie on $\\overarc{AB}$. So, one of the solutions is $\\boxed{R \\text{ in arc } AB\\text{ (excluding the endpoints)}}$.\n $R$ and $I$ lie on opposite sides of $PQ$. Then extend $ID$ out from $D$ to $X$ such that $DX=TR$, and extend $IE$ out from $E$ to $Y$ such that $EY=TR$. Then we see that $IR=IX=IY$, so that $\\boxed{R \\text{ lies on arc } XY\\text{ (excluding the endpoints)}}$.",
    "Solution 2": "We claim that $R$ can lie on minor arc $AB$ of the circumcircle of triangle ABC, and it can also lie on the dilation of this arc about the center of triangle $ABC$ with a factor of $-2.$\n\nLet $D, E,$ and $F$ be the feet of the angle bisectors from points $A, B,$ and $C$ respectively. Trivially, $DEF$ is also the medial triangle, orthic triangle, and contact triangle (ABC is equilateral).\n\nLet $I$ be the incenter of ABC. Trivially, $I$ is the centroid, orthocenter, and circumcenter of ABC (ABC is equilateral). Also, $AD=BE=CF=3r$ where $r$ is the radius of circle $\\omega$ (This is trivial). $T$ is the point of tangency of $\\omega$ and segment $\\overline{PQ}$. \n\nR has to lie on the intersection of circles $\\omega1$(center P, radius PA) and $\\omega2$(center Q, radius QB), and for each choice of P, there exist two locations for R. The location that we claim to lie on the minor arc AB of the circumcircle of ABC shall be denoted M, and the other location shall be denoted N. \n\nDefine triangle XYZ to be the homothety of triangle ABC about I with a factor of -2.\n\nCritical claim: M, T, I, and N are collinear.\n\nProof:\nFirst we shall prove that T lies on MN using phantom points.\n\nLet the intersection of MN and PQ be denoted as K. We shall prove that K and T are the same point.\nLet $PT = p$ and $QT = q$. Because of the equal tangent theorem, $PD=PT=p$ and $QE=QT=q$. Hence, by the pythagorean theorem (recall $AD=BE=3r$), $PA^2 = 9r^2 + p^2$ and $QB^2 = 9r^2 + q^2$. Since PN = PA and QN = QB, then $PN^2 = 9r^2 + p^2$ and $QN^2 = 9r^2 + q^2$. \n\nPQ is the perpendicular bisector of MN because MN is the radical axis of $\\omega1$ and $\\omega2$. Hence, M is the reflection of N across K. Also, NK is the altitude of triangle PNQ, so $PK^2-QK^2 = PN^2-QN^2 = p^2 - q^2$ by using the pythagorean theorem and earlier expressions for $PN^2$ and $QN^2$. However, $PK+QK=PQ=p+q$. Now, we have a system of equations to solve for PK and QK in terms of p and q.\n\nDividing the first equation by the second (we can do this because p+q is always nonzero), we get $PK-QK=p-q$. Combining this with our PK+QK result, we get $PK = p$ and $QK = q$. However, $PT = p$ and $QT = q$, and only one point can exist on PQ for which this result holds true. As a result, K and T are the same point, otherwise it is a contradiction. Hence M, T, and N are collinear.\n\n$IT \\parallel MN$. This is because both MN and IT are perpendicular to PQ (IT is perpendicular to PQ because PQ is a tangent with point of tangency T). However, both lines share point T, as discussed earlier. Hence, IT and MN are the same line, and M, T, I, and N are collinear.\n\nIn fact, from our earlier results from the lengths of PN and PT, we can use the pythagorean theorem to get that $NT = 3r$, a result that is always true and independent of P and Q! Also, because M is the reflection of N over K (which is the same as T), $MT = 3r$ also. However, T varies based on P and Q. On the other hand, $IT = r$ and M, T, I and N are collinear. Remembering our earlier definitions of M and N, we get that $MI = 2r$ and $IN = 4r$, with M on the opposite side of N and T from I. Hence, M can be taken to N with a homothety about I with a factor of -2, and T can be taken to M with a homothety about I with a factor of -2. Since, trivially, the circumradius of ABC is 2r (ABC is equilateral), it seems like M can lie anywhere on the circumcircle of ABC.\n\nHowever, we must take into account the restrictions on P and Q. This limits T to only minor arc DE on the incircle of ABC, hence, because of our earlier homothety statement, M is restricted to minor arc AB on the circumcircle of ABC.  Because of our homothety statement about N, N has to lie on minor arc XY on the circumcircle of triangle XYZ.\n\nBecause we defined both M and N to be possible locations for R, $\\fbox{R can only lie on minor arc AB of the circumcircle of triangle ABC, and also on minor arc XY of the circumcircle of triangle XYZ}$.\n\n"
  }
}