{
  "competition_id": "2001_AMC_10_Problems",
  "problem_id": 20,
  "difficulty": 2,
  "problem": "A regular octagon is formed by cutting an isosceles right triangle from each of the corners of a square with sides of length $2000$. What is the length of each side of the octagon?\n$\\textbf{(A) } \\frac{1}{3}(2000) \\qquad \\textbf{(B) } {2000(\\sqrt{2}-1)} \\qquad \\textbf{(C) } {2000(2-\\sqrt{2})} \\qquad \\textbf{(D) } {1000} \\qquad \\textbf{(E) } {1000\\sqrt{2}}$",
  "solutions": {
    "Solution (Longer solution-credit: Ileytyn)": "First, realize that each triangle is congruent, a right triangle and that the two legs are equal. Also, each side of the octagon is equal, because of the definition of regular shapes. Let $s$ be the length of a leg of the isosceles right triangle. In terms of $s$, the hypotenuse of the isosceles right triangle, which is also the length of a side of the regular octagon, is $s \\sqrt{2}$. Since the length of each side of the square is 2000, the length of each side of the regular octagon is equal to the length of a side of the square ($2000$) subtracted by $2$ times the length of a leg of the isosceles right triangle ( the total length of the side is $2s+ o$, $o$ being the length of a side of the regular octagon), which is the same as $2s$. As an expression, this is $2000-2s$, which we can equate to $s \\sqrt{2}$, ( since the octagon is regular, meaning all of the side's lengths are congruent) giving us the following equation:$2000-2s = s \\sqrt{2}$. By isolating the variable and simplifying the right side, we get the following: $2000 = s(2 + \\sqrt{2})$. Dividing both sides by $(2 + \\sqrt{2})$, we arrive with $\\frac{2000}{2 + \\sqrt{2}} = s$, now, to find the length of the side of the octagon, we can plug in $s$ and use the equation $2000-2s = o$, $o$ being the length of a side of the octagon, to derive the value of a side of the octagon. After plugging in the values, we derive $2000-2(\\frac{2000}{2 + \\sqrt{2}})$, which is the same as $2000-(\\frac{4000}{2 + \\sqrt{2}})$, factoring out a $2000$, we derive the following: $2000(1-(\\frac{2}{2 + \\sqrt{2}}))$, by rationalizing the denominator of $\\frac{2}{2 + \\sqrt{2}}$, we get $2000(1-(2 - \\sqrt{2}))$, after expanding, finally, we get $\\boxed{\\textbf{(B) }2000(\\sqrt{2} -1)}$ !(not a factorial symbol, just an exclamation point)"
  }
}